//《C语言从入门到精通》P68
// 第三章 顺序与选择结构程序设计
// 3.1 C语句及赋值语句
// 16、阶梯问题

/* 有一条长阶梯，
	如果每步跨2阶，最后剩1阶；
	如果每步跨3阶，最后剩2阶；
	如果每步跨5阶，最后剩4阶；
	如果每步跨6阶，最后剩5阶；
	如果每步跨7阶，最后刚好走完。
	求满足上述条件的阶梯应该有几阶？
	仅求两位数和三位数的即可。
*/

#include<stdio.h>

void main()
{
	int i;

	printf("满足条件的两位数阶梯数为：\n");
	for (i = 10; i < 100; i++)
	{
		if (i % 2 == 1 && i % 3 == 2 && i % 5 == 4 && i % 6 == 5 && i % 7 == 0)
		{
			printf("%d,\n", i);
		}
	}
	
	printf("满足条件的两位数阶梯数为：\n");
	for (i = 100; i < 1000; i++)
	{
		if (i % 2 == 1 && i % 3 == 2 && i % 5 == 4 && i % 6 == 5 && i % 7 == 0)
		{
			printf("%d,\n", i);
		}
	}
}